src/docker/kubernates-handbook/theory/storage/persistent-volume.org
** 扩展PVC 
   #+begin_example
     Kubernetes 1.8 增加了对扩展持久化存储卷的 Alpha 支持
   #+end_example
   以下持久化卷支持扩展持久化卷声明：
   + gcePersistentDisk
   + awsElasticBlockStore
   + Cinder
   + glusterfs
   + rbd
   #+begin_example
     管理员可以通过将 ExpandPersistentVolumes 特性门设置为true来允许扩展持久卷声明

     管理员还应该启用PersistentVolumeClaimResize 准入控制插件来执行对可调整大小的卷的其他验证
   #+end_example

   一旦 PersistentVolumeClaimResize 准入插件已打开，将只允许其 _allowVolumeExpansion_ 字段设置为 _true_ 的存储类进行大小调整

   #+begin_example
     kind: StorageClass
     apiVersion: storage.k8s.io/v1
     metadata:
       name: gluster-vol-default
     provisioner: kubernetes.io/glusterfs
     parameters:
       resturl: "http://192.168.10.100:8080"
       restuser: ""
       secretNamespace: ""
       secretName: ""
     allowVolumeExpansion: true
   #+end_example

   一旦功能门和前述准入插件打开后，用户就可以通过简单地编辑声明以请求更大的 PersistentVolumeClaim 卷。这反过来将触发 PersistentVolume 后端的卷扩展

   #+begin_example
     在任何情况下都不会创建新的 PersistentVolume 来满足声明

     Kubernetes 将尝试调整现有 volume 来满足声明的要求
   #+end_example

   对于扩展包含文件系统的卷，只有在 ReadWrite 模式下使用 PersistentVolumeClaim 启动新的 Pod 时，才会执行文件系统调整大小

   #+begin_example
     换句话说，如果正在扩展的卷在 pod 或部署中使用，则需要删除并重新创建要进行文件系统调整大小的pod
   #+end_example


   文件系统调整大小仅适用于以下文件系统类型：
   + XFS
   + Ext3、Ext4

   #+begin_example
     注意：扩展 EBS 卷是一个耗时的操作

     另外，每6个小时有一个修改卷的配额
   #+end_example

* 类型

  PersistentVolume 类型以插件形式实现。Kubernetes 目前支持以下插件类型：
  + GCEPersistentDisk
  + AWSElasticBlockStore
  + AzureFile
  + AzureDisk
  + FC (Fibre Channel)
  + FlexVolume
  + Flocker
  + NFS
  + iSCSI
  + RBD (Ceph Block Device)
  + CephFS
  + Cinder (OpenStack block storage)
  + Glusterfs
  + VsphereVolume
  + Quobyte Volumes
  + HostPath
    #+begin_example
      仅限于但节点测试：不会以任何方式支持本地存储，也无法在多节点集群中工作
    #+end_example
  + VMware Photon
  + Portworx Volumes
  + ScaleIO Volumes
  + StorageOS

    原始块支持仅适用于以上这些插件
* PV
  每个 PV 配置中都包含一个 _sepc_ 规格字段和一个 _status_ 卷状态字段：

  #+begin_example
    apiVersion: v1
    kind: PersistentVolume
    metadata:
      name: pv0003
    spec:
      capacity:
	storage: 5Gi
      volumeMode: Filesystem
      accessModes:
	- ReadWriteOnce
      persistentVolumeReclaimPolicy: Recycle
      storageClassName: slow
      mountOptions:
	- hard
	- nfsvers=4.1
      nfs:
	path: /tmp
	server: 172.17.0.2
  #+end_example
** 容量
   通常，PV 将具有特定的存储容量。这是使用 PV 的容量属性设置的

   #+begin_example
     查看 Kubernetes 资源模型 以了解 capacity 预期

     目前，存储大小是可以设置或请求的唯一资源。未来的属性可能包括 IOPS、吞吐量等
   #+end_example

** 卷模式
   #+begin_example
     在 v1.9 之前，所有卷插件的默认行为是在持久卷上创建一个文件系统
   #+end_example
   在 v1.9 中，用户可以指定一个 _volumeMode_ ，除了文件系统之外，它现在将支持原始块设备
   + volumeMode 的有效值可以是 _Filesystem_ 或 _Block_
     + 如果未指定，volumeMode 将默认为“Filesystem”，这是一个可选的 API 参数

** 访问模式
   PersistentVolume 可以以资源提供者支持的任何方式挂载到主机上。如下表所示：

   #+CAPTION: access mode of volume type 
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | Volume 插件          | ReadWriteOnce | ReadOnlyMany | ReadWriteMany           |
   | AWSElasticBlockStore | ✓             | -            | -                       |
   | AzureFile            | ✓             | ✓            | ✓                       |
   | AzureDisk            | ✓             | -            | -                       |
   | CephFS               | ✓             | ✓            | ✓                       |
   | Cinder               | ✓             | -            | -                       |
   | FC                   | ✓             | ✓            | -                       |
   | FlexVolume           | ✓             | ✓            | -                       |
   | Flocker              | ✓             | -            | -                       |
   | GCEPersistentDisk    | ✓             | ✓            | -                       |
   | Glusterfs            | ✓             | ✓            | ✓                       |
   | HostPath             | ✓             | -            | -                       |
   | iSCSI                | ✓             | ✓            | -                       |
   | PhotonPersistentDisk | ✓             | -            | -                       |
   | Quobyte              | ✓             | ✓            | ✓                       |
   | NFS                  | ✓             | ✓            | ✓                       |
   | RBD                  | ✓             | ✓            | -                       |
   | VsphereVolume        | ✓             | -            | - （当 pod 并列时有效） |
   | PortworxVolume       | ✓             | -            | ✓                       |
   | ScaleIO              | ✓             | ✓            | -                       |
   | StorageOS            | ✓             | -            | -                       |

   存储模式包括：
   + _ReadWriteOnce_ : 该卷可以被 *单个节点以读/写* 模式挂载
   + _ReadOnlyMany_ : 该卷可以被 *多个节点以只读* 模式挂载
   + _ReadWriteMany_ : 该卷可以被 *多个节点以读/写* 模式挂载

     #+begin_example
       供应商具有不同的功能，每个 PV 的访问模式都将被设置为该卷支持的特定模式

       例如，NFS 可以支持多个读/写客户端，但特定的 NFS PV 可能以只读方式导出到服务器上

       每个 PV 都有一套自己的用来描述特定功能的访问模式
     #+end_example

   注意： *一个卷一次只能使用一种访问模式挂载* ，即使它支持很多访问模式

   #+begin_example
     例如，GCEPersistentDisk 可以由单个节点作为 ReadWriteOnce 模式挂载，或由多个节点以 ReadOnlyMany 模式挂载，但不能同时挂载
   #+end_example

   在命令行中，访问模式缩写为：
   + _RWO_ : ReadWriteOnce
   + _ROX_ : ReadOnlyMany
   + _RWX_ : ReadWriteMany

** 类
   PV 可以具有一个类，通过将 _storageClassName_ 属性设置为 StorageClass 的名称来指定该类：
   + 一个特定类别的 PV 只能绑定到请求该类别的 PVC
   + 没有 storageClassName 的 PV 就没有类，它只能绑定到不需要特定类的 PVC 

   #+begin_example
     过去，使用的是 volume.beta.kubernetes.io/storage-class 注解而不是 storageClassName 属性

     这个注解仍然有效，但是将来的 Kubernetes 版本中将会完全弃用它
   #+end_example

** 回收策略
   当前的回收策略包括：
   + _Retain_ （保留）: 手动回收
   + _Recycle_ （回收）: 基本擦除（rm -rf /thevolume/*）
   + _Delete_ （删除）: 关联的存储资产将被删除

     #+begin_example
       当前，只有 NFS 和 HostPath 支持回收策略

       AWS EBS、GCE PD、Azure Disk 和 Cinder 卷支持删除策略
     #+end_example
