html/docker/kubernates-handbook/theory/storage/persistent-volume.html

<div id="outline-container-org0fd1e30" class="outline-3">
<h3 id="org0fd1e30">扩展PVC</h3>
<div class="outline-text-3" id="text-org0fd1e30">
<pre class="example" id="org1f6fde6">
Kubernetes 1.8 增加了对扩展持久化存储卷的 Alpha 支持
</pre>
<p>
以下持久化卷支持扩展持久化卷声明：
</p>
<ul class="org-ul">
<li>gcePersistentDisk</li>
<li>awsElasticBlockStore</li>
<li>Cinder</li>
<li>glusterfs</li>
<li>rbd</li>
</ul>
<pre class="example" id="org931bb9f">
管理员可以通过将 ExpandPersistentVolumes 特性门设置为true来允许扩展持久卷声明

管理员还应该启用PersistentVolumeClaimResize 准入控制插件来执行对可调整大小的卷的其他验证
</pre>

<p>
一旦 PersistentVolumeClaimResize 准入插件已打开，将只允许其 <span class="underline">allowVolumeExpansion</span> 字段设置为 <span class="underline">true</span> 的存储类进行大小调整
</p>

<pre class="example" id="orgfa3e028">
kind: StorageClass
apiVersion: storage.k8s.io/v1
metadata:
  name: gluster-vol-default
provisioner: kubernetes.io/glusterfs
parameters:
  resturl: "http://192.168.10.100:8080"
  restuser: ""
  secretNamespace: ""
  secretName: ""
allowVolumeExpansion: true
</pre>

<p>
一旦功能门和前述准入插件打开后，用户就可以通过简单地编辑声明以请求更大的 PersistentVolumeClaim 卷。这反过来将触发 PersistentVolume 后端的卷扩展
</p>

<pre class="example" id="org0296c34">
在任何情况下都不会创建新的 PersistentVolume 来满足声明

Kubernetes 将尝试调整现有 volume 来满足声明的要求
</pre>

<p>
对于扩展包含文件系统的卷，只有在 ReadWrite 模式下使用 PersistentVolumeClaim 启动新的 Pod 时，才会执行文件系统调整大小
</p>

<pre class="example" id="orgf6bb6ca">
换句话说，如果正在扩展的卷在 pod 或部署中使用，则需要删除并重新创建要进行文件系统调整大小的pod
</pre>


<p>
文件系统调整大小仅适用于以下文件系统类型：
</p>
<ul class="org-ul">
<li>XFS</li>
<li>Ext3、Ext4</li>
</ul>

<pre class="example" id="org0f68ec9">
注意：扩展 EBS 卷是一个耗时的操作

另外，每6个小时有一个修改卷的配额
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee36015" class="outline-2">
<h2 id="orgee36015">类型</h2>
<div class="outline-text-2" id="text-orgee36015">
<p>
PersistentVolume 类型以插件形式实现。Kubernetes 目前支持以下插件类型：
</p>
<ul class="org-ul">
<li>GCEPersistentDisk</li>
<li>AWSElasticBlockStore</li>
<li>AzureFile</li>
<li>AzureDisk</li>
<li>FC (Fibre Channel)</li>
<li>FlexVolume</li>
<li>Flocker</li>
<li>NFS</li>
<li>iSCSI</li>
<li>RBD (Ceph Block Device)</li>
<li>CephFS</li>
<li>Cinder (OpenStack block storage)</li>
<li>Glusterfs</li>
<li>VsphereVolume</li>
<li>Quobyte Volumes</li>
<li><p>
HostPath
</p>
<pre class="example" id="org77d85ee">
仅限于但节点测试：不会以任何方式支持本地存储，也无法在多节点集群中工作
</pre></li>
<li>VMware Photon</li>
<li>Portworx Volumes</li>
<li>ScaleIO Volumes</li>
<li><p>
StorageOS
</p>

<p>
原始块支持仅适用于以上这些插件
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orgc636dd0" class="outline-2">
<h2 id="orgc636dd0">PV</h2>
<div class="outline-text-2" id="text-orgc636dd0">
<p>
每个 PV 配置中都包含一个 <span class="underline">sepc</span> 规格字段和一个 <span class="underline">status</span> 卷状态字段：
</p>

<pre class="example" id="org0c66887">
apiVersion: v1
kind: PersistentVolume
metadata:
  name: pv0003
spec:
  capacity:
    storage: 5Gi
  volumeMode: Filesystem
  accessModes:
    - ReadWriteOnce
  persistentVolumeReclaimPolicy: Recycle
  storageClassName: slow
  mountOptions:
    - hard
    - nfsvers=4.1
  nfs:
    path: /tmp
    server: 172.17.0.2
</pre>
</div>
<div id="outline-container-org290f97f" class="outline-3">
<h3 id="org290f97f">容量</h3>
<div class="outline-text-3" id="text-org290f97f">
<p>
通常，PV 将具有特定的存储容量。这是使用 PV 的容量属性设置的
</p>

<pre class="example" id="orgd0acec1">
查看 Kubernetes 资源模型 以了解 capacity 预期

目前，存储大小是可以设置或请求的唯一资源。未来的属性可能包括 IOPS、吞吐量等
</pre>
</div>
</div>

<div id="outline-container-org4412b14" class="outline-3">
<h3 id="org4412b14">卷模式</h3>
<div class="outline-text-3" id="text-org4412b14">
<pre class="example" id="org6f6ddac">
在 v1.9 之前，所有卷插件的默认行为是在持久卷上创建一个文件系统
</pre>
<p>
在 v1.9 中，用户可以指定一个 <span class="underline">volumeMode</span> ，除了文件系统之外，它现在将支持原始块设备
</p>
<ul class="org-ul">
<li>volumeMode 的有效值可以是 <span class="underline">Filesystem</span> 或 <span class="underline">Block</span>
<ul class="org-ul">
<li>如果未指定，volumeMode 将默认为“Filesystem”，这是一个可选的 API 参数</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgbb5c0be" class="outline-3">
<h3 id="orgbb5c0be">访问模式</h3>
<div class="outline-text-3" id="text-orgbb5c0be">
<p>
PersistentVolume 可以以资源提供者支持的任何方式挂载到主机上。如下表所示：
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 1:</span> access mode of volume type</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Volume 插件</td>
<td class="org-left">ReadWriteOnce</td>
<td class="org-left">ReadOnlyMany</td>
<td class="org-left">ReadWriteMany</td>
</tr>

<tr>
<td class="org-left">AWSElasticBlockStore</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">AzureFile</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left">AzureDisk</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">CephFS</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left">Cinder</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">FC</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">FlexVolume</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">Flocker</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">GCEPersistentDisk</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">Glusterfs</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left">HostPath</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">iSCSI</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">PhotonPersistentDisk</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">Quobyte</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left">NFS</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left">RBD</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">VsphereVolume</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
<td class="org-left">- （当 pod 并列时有效）</td>
</tr>

<tr>
<td class="org-left">PortworxVolume</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left">ScaleIO</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">StorageOS</td>
<td class="org-left">✓</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
</tr>
</tbody>
</table>

<p>
存储模式包括：
</p>
<ul class="org-ul">
<li><span class="underline">ReadWriteOnce</span> : 该卷可以被 <b>单个节点以读/写</b> 模式挂载</li>
<li><span class="underline">ReadOnlyMany</span> : 该卷可以被 <b>多个节点以只读</b> 模式挂载</li>
<li><p>
<span class="underline">ReadWriteMany</span> : 该卷可以被 <b>多个节点以读/写</b> 模式挂载
</p>

<pre class="example" id="org360429a">
供应商具有不同的功能，每个 PV 的访问模式都将被设置为该卷支持的特定模式

例如，NFS 可以支持多个读/写客户端，但特定的 NFS PV 可能以只读方式导出到服务器上

每个 PV 都有一套自己的用来描述特定功能的访问模式
</pre></li>
</ul>

<p>
注意： <b>一个卷一次只能使用一种访问模式挂载</b> ，即使它支持很多访问模式
</p>

<pre class="example" id="orgc96dd9b">
例如，GCEPersistentDisk 可以由单个节点作为 ReadWriteOnce 模式挂载，或由多个节点以 ReadOnlyMany 模式挂载，但不能同时挂载
</pre>

<p>
在命令行中，访问模式缩写为：
</p>
<ul class="org-ul">
<li><span class="underline">RWO</span> : ReadWriteOnce</li>
<li><span class="underline">ROX</span> : ReadOnlyMany</li>
<li><span class="underline">RWX</span> : ReadWriteMany</li>
</ul>
</div>
</div>

<div id="outline-container-orgb034310" class="outline-3">
<h3 id="orgb034310">类</h3>
<div class="outline-text-3" id="text-orgb034310">
<p>
PV 可以具有一个类，通过将 <span class="underline">storageClassName</span> 属性设置为 StorageClass 的名称来指定该类：
</p>
<ul class="org-ul">
<li>一个特定类别的 PV 只能绑定到请求该类别的 PVC</li>
<li>没有 storageClassName 的 PV 就没有类，它只能绑定到不需要特定类的 PVC</li>
</ul>

<pre class="example" id="orgd795bf1">
过去，使用的是 volume.beta.kubernetes.io/storage-class 注解而不是 storageClassName 属性

这个注解仍然有效，但是将来的 Kubernetes 版本中将会完全弃用它
</pre>
</div>
</div>

<div id="outline-container-orgb025ed1" class="outline-3">
<h3 id="orgb025ed1">回收策略</h3>
<div class="outline-text-3" id="text-orgb025ed1">
<p>
当前的回收策略包括：
</p>
<ul class="org-ul">
<li><span class="underline">Retain</span> （保留）: 手动回收</li>
<li><span class="underline">Recycle</span> （回收）: 基本擦除（rm -rf /thevolume/*）</li>
<li><p>
<span class="underline">Delete</span> （删除）: 关联的存储资产将被删除
</p>

<pre class="example" id="orgcb9befd">
当前，只有 NFS 和 HostPath 支持回收策略

AWS EBS、GCE PD、Azure Disk 和 Cinder 卷支持删除策略
</pre></li>
</ul>
</div>
</div>
