src/docker/kubernates-handbook/theory/storage/persistent-volume.org
** 挂载选项
   Kubernetes 管理员可以指定在节点上为挂载持久卷指定挂载选项

   #+begin_example
     注意：不是所有的持久化卷类型都支持挂载选项
   #+end_example

   以下卷类型支持挂载选项：
   + GCEPersistentDisk
   + AWSElasticBlockStore
   + AzureFile
   + AzureDisk
   + NFS
   + iSCSI
   + RBD (Ceph Block Device)
   + CephFS
   + Cinder （OpenStack 卷存储）
   + Glusterfs
   + VsphereVolume
   + Quobyte Volumes
   + VMware Photon

   挂载选项没有校验，如果挂载选项无效则挂载失败 

   #+begin_example
     过去，使用 volume.beta.kubernetes.io/mount-options 注解而不是 mountOptions 属性

     这个注解仍然有效，但在将来的 Kubernetes 版本中它将会被完全弃用
   #+end_example
** 状态
   卷可以处于以下的某种状态：
   + _Available_ （可用）：一块空闲资源还没有被任何声明绑定
   + _Bound_ （已绑定）：卷已经被声明绑定
   + _Released_ （已释放）：声明被删除，但是资源还未被集群重新声明
   + _Failed_ （失败）：该卷的自动回收失败

   命令行会显示绑定到 PV 的 PVC 的名称 
* PVC
  每个 PVC 中都包含一个 _spec_ 规格字段和一个 _status_ 声明状态字段：

  #+BEGIN_EXAMPLE
    kind: PersistentVolumeClaim
    apiVersion: v1
    metadata:
      name: myclaim
    spec:
      accessModes:
	- ReadWriteOnce
      volumeMode: Filesystem
      resources:
	requests:
	  storage: 8Gi
      storageClassName: slow
      selector:
	matchLabels:
	  release: "stable"
	matchExpressions:
	  - {key: environment, operator: In, values: [dev]}
  #+END_EXAMPLE
** 访问模式
   在请求具有特定访问模式的存储时，声明使用与卷相同的约定
** 卷模式
   声明使用与卷相同的约定，指示将卷作为 _文件系统_ 或 _块设备_ 使用 
** 资源
   像 pod 一样，声明可以请求特定数量的资源。在这种情况下，请求是用于存储的。相同的资源模型适用于卷和声明 
** 选择器
   可以指定一个标签选择器来进一步过滤该组卷。只有标签与选择器匹配的卷可以绑定到声明。选择器由两个字段组成：
   + _matchLabels_ ：volume 必须有具有该值的标签
   + _matchExpressions_ ：这是一个要求列表，通过指定关键字，值列表以及与关键字和值相关的运算符组成
     + 有效的运算符包括 In、NotIn、Exists 和 DoesNotExist 

   所有来自 matchLabels 和 matchExpressions 的要求都被 *与* 在一起——它们必须全部满足才能匹配 
** 类
   可以通过使用属性 storageClassName 指定 StorageClass 的名称来请求特定的类。只有所请求的类与 PVC 具有相同 storageClassName 的 PV 才能绑定到 PVC。
   #+BEGIN_EXAMPLE
     PVC 不一定要请求类。其 storageClassName 设置为 "" 的 PVC 始终被解释为没有请求类的 PV，因此只能绑定到没有类的 PV（没有注解或 ""）
   #+END_EXAMPLE
   没有 storageClassName 的 PVC 根据是否打开DefaultStorageClass 准入控制插件，集群对其进行不同处理：
   + 如果打开了准入控制插件：
     + 管理员可以指定一个默认的 StorageClass，所有没有 StorageClassName 的 PVC 将被绑定到该默认的 PV
       #+BEGIN_EXAMPLE
	 通过在 StorageClass 对象中将注解 storageclass.kubernetes.io/is-default-class 设置为 “true” 来指定默认的 StorageClass
       #+END_EXAMPLE
     + 如果管理员没有指定缺省值，那么集群会响应 PVC 创建，就好像关闭了准入控制插件一样
     + 如果指定了多个默认值，则准入控制插件将禁止所有 PVC 创建
   + 如果准入控制插件被关闭，则没有默认 StorageClass 的概念：
     + 所有没有 storageClassName 的 PVC 只能绑定到没有类的 PV
       #+BEGIN_EXAMPLE
	 在这种情况下，没有 storageClassName 的 PVC 的处理方式与 storageClassName 设置为 "" 的 PVC 的处理方式相同
       #+END_EXAMPLE

   #+BEGIN_EXAMPLE
     根据安装方法的不同，默认的 StorageClass 可以在安装过程中通过插件管理器部署到 Kubernetes 集群
   #+END_EXAMPLE

   当 PVC 指定了 selector，除了请求一个 StorageClass 之外，这些需求被“与”在一起：只有被请求的类的 PV 具有和被请求的标签才可以被绑定到 PVC。
   #+BEGIN_EXAMPLE
     注意：目前，具有非空 selector 的 PVC 不能为其动态配置 PV

     过去，使用注解 volume.beta.kubernetes.io/storage-class 而不是 storageClassName 属性，这个注解仍然有效，但是在未来的 Kubernetes 版本中不会支持
   #+END_EXAMPLE
* 声明作为卷
  通过将声明用作卷来访问存储

  #+BEGIN_EXAMPLE
    声明必须与使用声明的 pod 存在于相同的命名空间中
  #+END_EXAMPLE

  集群在 pod 的命名空间中查找声明，并使用它来获取支持声明的 PersistentVolume，该卷然后被挂载到主机的 pod 上

  #+BEGIN_EXAMPLE
    kind: Pod
    apiVersion: v1
    metadata:
      name: mypod
    spec:
      containers:
	- name: myfrontend
	  image: dockerfile/nginx
	  volumeMounts:
	  - mountPath: "/var/www/html"
	    name: mypd
      volumes:
	- name: mypd
	  persistentVolumeClaim:
	    claimName: myclaim
  #+END_EXAMPLE
** 命名空间 
   PersistentVolumes 绑定是唯一的，并且由于 PersistentVolumeClaims 是命名空间对象，因此只能在一个 _命名空间_ 内挂载具有 *多个* 模式（ROX、RWX）的声明 
* 原始块卷
  #+BEGIN_EXAMPLE
    原始块卷的静态配置在 v1.9 中作为 alpha 功能引入

    由于这个改变，需要一些新的 API 字段来使用该功能

    目前，Fibre Channl 是支持该功能的唯一插件
  #+END_EXAMPLE
** 使用原始块卷作为pv 
   #+BEGIN_EXAMPLE
     apiVersion: v1
     kind: PersistentVolume
     metadata:
       name: block-pv
     spec:
       capacity:
	 storage: 10Gi
       accessModes:
	 - ReadWriteOnce
       volumeMode: Block
       persistentVolumeReclaimPolicy: Retain
       fc:
	 targetWWNs: ["50060e801049cfd1"]
	 lun: 0
	 readOnly: false
   #+END_EXAMPLE
** pvc请求原始块卷
   #+BEGIN_EXAMPLE
     apiVersion: v1
     kind: PersistentVolumeClaim
     metadata:
       name: block-pvc
     spec:
       accessModes:
	 - ReadWriteOnce
       volumeMode: Block
       resources:
	 requests:
	   storage: 10Gi
   #+END_EXAMPLE
** 在 Pod 规格配置中为容器添加原始块设备
   #+BEGIN_EXAMPLE
     apiVersion: v1
     kind: Pod
     metadata:
       name: pod-with-block-volume
     spec:
       containers:
	 - name: fc-container
	   image: fedora:26
	   command: ["/bin/sh", "-c"]
	   args: [ "tail -f /dev/null" ]
	   volumeDevices:
	     - name: data
	       devicePath: /dev/xvda
       volumes:
	 - name: data
	   persistentVolumeClaim:
	     claimName: block-pvc
   #+END_EXAMPLE

   注意：当为 Pod 增加原始块设备时，在容器中指定 _设备_ 路径而不是挂载路径 
** 绑定块卷
   如果用户通过使用 _PersistentVolumeClaim_ 规范中的 _volumeMode_ 字段指示此请求来请求 _原始块卷_ ，则绑定规则与以前不认为该模式为规范一部分的版本略有不同。下面是用户和管理员指定请求原始块设备的可能组合的表格。该表指示卷是否将被绑定或未给定组合。静态设置的卷的卷绑定矩阵：

   #+CAPTION: Binding pvc to pv 
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | PV volumeMode	 | PVC volumeMode | 结果   |
   | unspecified           | unspecified    | 绑定   |
   | unspecified           | Block          | 不绑定 |
   | unspecified           | Filesystem     | 绑定   |
   | Block	         | unspecified    | 不绑定 |
   | Block	         | Block	  | 绑定   |
   | Block	         | Filesystem     | 不绑定 |
   | Filesystem            | Filesystem     | 绑定   |
   | Filesystem            | Block          | 不绑定 |
   | Filesystem            | unspecified    | 绑定   |

   #+BEGIN_EXAMPLE
     注意：alpha 版本只支持静态配置卷。使用原始块设备时，管理员应该注意考虑这些值
   #+END_EXAMPLE
