html/docker/kubernates-handbook/theory/storage/persistent-volume.html
<div id="outline-container-org4b3dc93" class="outline-3">
<h3 id="org4b3dc93">挂载选项</h3>
<div class="outline-text-3" id="text-org4b3dc93">
<p>
Kubernetes 管理员可以指定在节点上为挂载持久卷指定挂载选项
</p>

<pre class="example" id="orga6d0f1a">
注意：不是所有的持久化卷类型都支持挂载选项
</pre>

<p>
以下卷类型支持挂载选项：
</p>
<ul class="org-ul">
<li>GCEPersistentDisk</li>
<li>AWSElasticBlockStore</li>
<li>AzureFile</li>
<li>AzureDisk</li>
<li>NFS</li>
<li>iSCSI</li>
<li>RBD (Ceph Block Device)</li>
<li>CephFS</li>
<li>Cinder （OpenStack 卷存储）</li>
<li>Glusterfs</li>
<li>VsphereVolume</li>
<li>Quobyte Volumes</li>
<li>VMware Photon</li>
</ul>

<p>
挂载选项没有校验，如果挂载选项无效则挂载失败 
</p>

<pre class="example" id="org9fdf1de">
过去，使用 volume.beta.kubernetes.io/mount-options 注解而不是 mountOptions 属性

这个注解仍然有效，但在将来的 Kubernetes 版本中它将会被完全弃用
</pre>
</div>
</div>
<div id="outline-container-org5abf639" class="outline-3">
<h3 id="org5abf639">状态</h3>
<div class="outline-text-3" id="text-org5abf639">
<p>
卷可以处于以下的某种状态：
</p>
<ul class="org-ul">
<li><span class="underline">Available</span> （可用）：一块空闲资源还没有被任何声明绑定</li>
<li><span class="underline">Bound</span> （已绑定）：卷已经被声明绑定</li>
<li><span class="underline">Released</span> （已释放）：声明被删除，但是资源还未被集群重新声明</li>
<li><span class="underline">Failed</span> （失败）：该卷的自动回收失败</li>
</ul>

<p>
命令行会显示绑定到 PV 的 PVC 的名称 
</p>
</div>
</div>
</div>
<div id="outline-container-org36980b5" class="outline-2">
<h2 id="org36980b5">PVC</h2>
<div class="outline-text-2" id="text-org36980b5">
<p>
每个 PVC 中都包含一个 <span class="underline">spec</span> 规格字段和一个 <span class="underline">status</span> 声明状态字段：
</p>

<pre class="example" id="orgea82f87">
kind: PersistentVolumeClaim
apiVersion: v1
metadata:
  name: myclaim
spec:
  accessModes:
    - ReadWriteOnce
  volumeMode: Filesystem
  resources:
    requests:
      storage: 8Gi
  storageClassName: slow
  selector:
    matchLabels:
      release: "stable"
    matchExpressions:
      - {key: environment, operator: In, values: [dev]}
</pre>
</div>
<div id="outline-container-org3f705dc" class="outline-3">
<h3 id="org3f705dc">访问模式</h3>
<div class="outline-text-3" id="text-org3f705dc">
<p>
在请求具有特定访问模式的存储时，声明使用与卷相同的约定
</p>
</div>
</div>
<div id="outline-container-org1adb71f" class="outline-3">
<h3 id="org1adb71f">卷模式</h3>
<div class="outline-text-3" id="text-org1adb71f">
<p>
声明使用与卷相同的约定，指示将卷作为 <span class="underline">文件系统</span> 或 <span class="underline">块设备</span> 使用 
</p>
</div>
</div>
<div id="outline-container-orgd19cde2" class="outline-3">
<h3 id="orgd19cde2">资源</h3>
<div class="outline-text-3" id="text-orgd19cde2">
<p>
像 pod 一样，声明可以请求特定数量的资源。在这种情况下，请求是用于存储的。相同的资源模型适用于卷和声明 
</p>
</div>
</div>
<div id="outline-container-org1aca736" class="outline-3">
<h3 id="org1aca736">选择器</h3>
<div class="outline-text-3" id="text-org1aca736">
<p>
可以指定一个标签选择器来进一步过滤该组卷。只有标签与选择器匹配的卷可以绑定到声明。选择器由两个字段组成：
</p>
<ul class="org-ul">
<li><span class="underline">matchLabels</span> ：volume 必须有具有该值的标签</li>
<li><span class="underline">matchExpressions</span> ：这是一个要求列表，通过指定关键字，值列表以及与关键字和值相关的运算符组成
<ul class="org-ul">
<li>有效的运算符包括 In、NotIn、Exists 和 DoesNotExist</li>
</ul></li>
</ul>

<p>
所有来自 matchLabels 和 matchExpressions 的要求都被 <b>与</b> 在一起——它们必须全部满足才能匹配 
</p>
</div>
</div>
<div id="outline-container-org9951ea2" class="outline-3">
<h3 id="org9951ea2">类</h3>
<div class="outline-text-3" id="text-org9951ea2">
<p>
可以通过使用属性 storageClassName 指定 StorageClass 的名称来请求特定的类。只有所请求的类与 PVC 具有相同 storageClassName 的 PV 才能绑定到 PVC。
</p>
<pre class="example" id="org55a4112">
PVC 不一定要请求类。其 storageClassName 设置为 "" 的 PVC 始终被解释为没有请求类的 PV，因此只能绑定到没有类的 PV（没有注解或 ""）
</pre>
<p>
没有 storageClassName 的 PVC 根据是否打开DefaultStorageClass 准入控制插件，集群对其进行不同处理：
</p>
<ul class="org-ul">
<li>如果打开了准入控制插件：
<ul class="org-ul">
<li><p>
管理员可以指定一个默认的 StorageClass，所有没有 StorageClassName 的 PVC 将被绑定到该默认的 PV
</p>
<pre class="example" id="org6d5f46f">
通过在 StorageClass 对象中将注解 storageclass.kubernetes.io/is-default-class 设置为 “true” 来指定默认的 StorageClass
</pre></li>
<li>如果管理员没有指定缺省值，那么集群会响应 PVC 创建，就好像关闭了准入控制插件一样</li>
<li>如果指定了多个默认值，则准入控制插件将禁止所有 PVC 创建</li>
</ul></li>
<li>如果准入控制插件被关闭，则没有默认 StorageClass 的概念：
<ul class="org-ul">
<li><p>
所有没有 storageClassName 的 PVC 只能绑定到没有类的 PV
</p>
<pre class="example" id="org2e04e21">
在这种情况下，没有 storageClassName 的 PVC 的处理方式与 storageClassName 设置为 "" 的 PVC 的处理方式相同
</pre></li>
</ul></li>
</ul>

<pre class="example" id="orgfb39fa5">
根据安装方法的不同，默认的 StorageClass 可以在安装过程中通过插件管理器部署到 Kubernetes 集群
</pre>

<p>
当 PVC 指定了 selector，除了请求一个 StorageClass 之外，这些需求被“与”在一起：只有被请求的类的 PV 具有和被请求的标签才可以被绑定到 PVC。
</p>
<pre class="example" id="org6ae1268">
注意：目前，具有非空 selector 的 PVC 不能为其动态配置 PV

过去，使用注解 volume.beta.kubernetes.io/storage-class 而不是 storageClassName 属性，这个注解仍然有效，但是在未来的 Kubernetes 版本中不会支持
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc3df4c5" class="outline-2">
<h2 id="orgc3df4c5">声明作为卷</h2>
<div class="outline-text-2" id="text-orgc3df4c5">
<p>
通过将声明用作卷来访问存储
</p>

<pre class="example" id="orgbbee667">
声明必须与使用声明的 pod 存在于相同的命名空间中
</pre>

<p>
集群在 pod 的命名空间中查找声明，并使用它来获取支持声明的 PersistentVolume，该卷然后被挂载到主机的 pod 上
</p>

<pre class="example" id="orge5b735c">
kind: Pod
apiVersion: v1
metadata:
  name: mypod
spec:
  containers:
    - name: myfrontend
      image: dockerfile/nginx
      volumeMounts:
      - mountPath: "/var/www/html"
	name: mypd
  volumes:
    - name: mypd
      persistentVolumeClaim:
	claimName: myclaim
</pre>
</div>
<div id="outline-container-org39b8949" class="outline-3">
<h3 id="org39b8949">命名空间</h3>
<div class="outline-text-3" id="text-org39b8949">
<p>
PersistentVolumes 绑定是唯一的，并且由于 PersistentVolumeClaims 是命名空间对象，因此只能在一个 <span class="underline">命名空间</span> 内挂载具有 <b>多个</b> 模式（ROX、RWX）的声明 
</p>
</div>
</div>
</div>
<div id="outline-container-orgb744696" class="outline-2">
<h2 id="orgb744696">原始块卷</h2>
<div class="outline-text-2" id="text-orgb744696">
<pre class="example" id="orga617ee7">
原始块卷的静态配置在 v1.9 中作为 alpha 功能引入

由于这个改变，需要一些新的 API 字段来使用该功能

目前，Fibre Channl 是支持该功能的唯一插件
</pre>
</div>
<div id="outline-container-org2290c5c" class="outline-3">
<h3 id="org2290c5c">使用原始块卷作为pv</h3>
<div class="outline-text-3" id="text-org2290c5c">
<pre class="example" id="orga8d3e63">
apiVersion: v1
kind: PersistentVolume
metadata:
  name: block-pv
spec:
  capacity:
    storage: 10Gi
  accessModes:
    - ReadWriteOnce
  volumeMode: Block
  persistentVolumeReclaimPolicy: Retain
  fc:
    targetWWNs: ["50060e801049cfd1"]
    lun: 0
    readOnly: false
</pre>
</div>
</div>
<div id="outline-container-org672953e" class="outline-3">
<h3 id="org672953e">pvc请求原始块卷</h3>
<div class="outline-text-3" id="text-org672953e">
<pre class="example" id="org6a33250">
apiVersion: v1
kind: PersistentVolumeClaim
metadata:
  name: block-pvc
spec:
  accessModes:
    - ReadWriteOnce
  volumeMode: Block
  resources:
    requests:
      storage: 10Gi
</pre>
</div>
</div>
<div id="outline-container-org64a8757" class="outline-3">
<h3 id="org64a8757">在 Pod 规格配置中为容器添加原始块设备</h3>
<div class="outline-text-3" id="text-org64a8757">
<pre class="example" id="orgb7fa964">
apiVersion: v1
kind: Pod
metadata:
  name: pod-with-block-volume
spec:
  containers:
    - name: fc-container
      image: fedora:26
      command: ["/bin/sh", "-c"]
      args: [ "tail -f /dev/null" ]
      volumeDevices:
	- name: data
	  devicePath: /dev/xvda
  volumes:
    - name: data
      persistentVolumeClaim:
	claimName: block-pvc
</pre>

<p>
注意：当为 Pod 增加原始块设备时，在容器中指定 <span class="underline">设备</span> 路径而不是挂载路径 
</p>
</div>
</div>
<div id="outline-container-org726d2e7" class="outline-3">
<h3 id="org726d2e7">绑定块卷</h3>
<div class="outline-text-3" id="text-org726d2e7">
<p>
如果用户通过使用 <span class="underline">PersistentVolumeClaim</span> 规范中的 <span class="underline">volumeMode</span> 字段指示此请求来请求 <span class="underline">原始块卷</span> ，则绑定规则与以前不认为该模式为规范一部分的版本略有不同。下面是用户和管理员指定请求原始块设备的可能组合的表格。该表指示卷是否将被绑定或未给定组合。静态设置的卷的卷绑定矩阵：
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 2:</span> Binding pvc to pv</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">PV volumeMode</td>
<td class="org-left">PVC volumeMode</td>
<td class="org-left">结果</td>
</tr>

<tr>
<td class="org-left">unspecified</td>
<td class="org-left">unspecified</td>
<td class="org-left">绑定</td>
</tr>

<tr>
<td class="org-left">unspecified</td>
<td class="org-left">Block</td>
<td class="org-left">不绑定</td>
</tr>

<tr>
<td class="org-left">unspecified</td>
<td class="org-left">Filesystem</td>
<td class="org-left">绑定</td>
</tr>

<tr>
<td class="org-left">Block</td>
<td class="org-left">unspecified</td>
<td class="org-left">不绑定</td>
</tr>

<tr>
<td class="org-left">Block</td>
<td class="org-left">Block</td>
<td class="org-left">绑定</td>
</tr>

<tr>
<td class="org-left">Block</td>
<td class="org-left">Filesystem</td>
<td class="org-left">不绑定</td>
</tr>

<tr>
<td class="org-left">Filesystem</td>
<td class="org-left">Filesystem</td>
<td class="org-left">绑定</td>
</tr>

<tr>
<td class="org-left">Filesystem</td>
<td class="org-left">Block</td>
<td class="org-left">不绑定</td>
</tr>

<tr>
<td class="org-left">Filesystem</td>
<td class="org-left">unspecified</td>
<td class="org-left">绑定</td>
</tr>
</tbody>
</table>

<pre class="example" id="orgdb5a33e">
注意：alpha 版本只支持静态配置卷。使用原始块设备时，管理员应该注意考虑这些值
</pre>
</div>
</div>
</div>
